{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
         "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
         "context": [""]
        },
        {"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
         "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
         "context": [""]
        },
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"],
         "context": [""]
        },
        {"tag": "noanswer",
         "patterns": [" ",""],
         "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
         "context": [""]
        },
        {"tag":"question1",
        "patterns":["I m not able to access my Bitrix24 account?","How to access Bitrix24 account?"],
        "responses":["Go to cloudcounselage24.bitrix24.com On the Login page, In the, Enter the phone number or email, type in your email id that you have registered with Cloud Counselage and Click Forgot Password. In case the problem persists, please write a mail to hrsupport@cloudcounselage.in"],
        "context_filter":""
        },
        {"tag":"question2",
        "patterns":["What is the job profile? Will we be able to work only in the tech we have chosen for the internship?","can you tell me about job profile?","which technology we will work in internship?"],
        "responses":["Your job profile is 'Technology - Intern'; if you're in cloud computing technology to update in your LinkedIn or resume, you can write as 'Cloud Computing - Intern'. Yes, you'll only work in the technology you're selected for but you can take the training of other technologies."],
        "context_filter":""
        },
        {"tag":"question3",
        "patterns":["Not able to access the LP1 page with my token When I put my token it redirects me to the home page Getting error while accessing the page- User Not Found Website Redirection Issue Tokens not working.","Not able to access my Lp1?","How to access Lp1?"],
        "responses":["Please watch the videos shared with the invite and you should not face any problems in accessing the training. Please follow the protocol shown in the videos."],
        "context_filter":""
        },
        {"tag":"question4",
        "patterns":[" Login issues with training for every module of LP1 LP2, do we have to register again for access to the content?","issues while login training module?"],
        "responses":["Yes, you need to register for every module of training. Some of you are facing login issues, we have kept the training visible without login. Even then, to post a comment and give a quiz you'll have to login. In case you face difficulty to do so, please try to perform your quiz or post a comment by using a different browser or incognito mode."],
        "context_filter":""
        },
        {"tag":"question5",
        "patterns":["I am applying my 2nd token that is the LP1 then it shows invalid user but the first token was accepted. What should I do? Tokens not working"],
        "responses":["For each training of LP1, there are different tokens. Please read the tasks or watch the videos again meticulously. Try accessing it in incognito mode."],
        "context_filter":""
        },
        {"tag":"question6",
        "patterns":["I did follow the instructions given in the video, but still, I'm not able to log in for the LP1 task","I can't login Lp1?","why i can't access Lp1?"],
        "responses":["Ensure you're using the right token"],
        "context_filter":""
        },
        {"tag":"question7",
        "patterns":["Do I need to pass with the certificate in training","certificate in trainig is compulsory?"],
        "responses":["No, but please ensure you complete the training."],
        "context_filter":""
        },
        {"tag":"question8",
        "patterns":["I am not able to see my tasks","i can't see my task"],
        "responses":[" Please remove the default In Progress from your filter of the task section and try."],
        "context_filter":""
        },
        {"tag":"question9",
        "patterns":["What do we do in the work report?","what to write in work report?"],
        "responses":["As mentioned in the video, please write what you have done this week and request approval from your supervisor by clicking on send to supervisor."],
        "context_filter":""
        },
        {"tag":"question10",
        "patterns":["I just joined the group and I am not understanding what to do further. How do I start my internship?","how to start intership","i am not getting what to do in internship?"],
        "responses":["Please go through the mail from which you have accepted the invite and check the task section as well."],
        "context_filter":""
        },
        {"tag":"question11",
        "patterns":["What do I do after completing the quiz? how to complete the entire lp1","what to do after completing lp1?","what to do after lp1 is finished?"],
        "responses":["There are tokens for each training in the task, if this learning path is done, please wait for the next learning path to begin and then please try to finish it. If you are done with LP3 please wait for Live Projects to begin."],
        "context_filter":""
        },
        {"tag":"question12",
        "patterns":["Do I need to register every time I do different tasks of lp1?","do i have register every task for lp1?","is register every task of lp1 necessary?"],
        "responses":["There are codes in the LP1 assignment, and each time you have to register also, please check your task description"],
        "context_filter":""
        },
        {"tag":"question13",
        "patterns":["I have complete one training, I didn't find any options to continue my training.","how to continue my ongoing training?","what to do for continuing my training?"],
        "responses":["Go back to the technology Page. Enter the respective tokens and then work. follow the same process every time."],
        "context_filter":""
        },
        {"tag":"question14",
        "patterns":["I am not getting results of the training","How to get result of my training"],
        "responses":["They are just for your practice and not for our record, so you don't need the results of LP1 and LP2 training."],
        "context_filter":""
        },
        {"tag":"question15",
        "patterns":["Unable to access the quiz","I can't access the quiz"],
        "responses":["Please retry after some time in an incognito window"],
        "context_filter":""
        },
        {"tag":"question16",
        "patterns":["What to do after completing LP1/ LP2/ LP3?","What to do after completing all Learning path"],
        "responses":["Mark your task as finished and wait for the next instructions."],
        "context_filter":""
        },
        {"tag":"question17",
        "patterns":["Which Browser I should use?","Browser recommended for Internship?"],
        "responses":["Google Chrome is recommended"],
        "context_filter":""
        },
        {"tag":"question18",
        "patterns":["Do we need to complete all the six steps within 14 hours as you mentioned that we have to complete all the 6 steps within 2 weeks so it becomes 14 hours?"],
        "responses":["It's preferred if you complete the LP1 training in 2 weeks but not mandatory. LP1, LP2, and LP3 are expected to be completed before the live projects start in July; but that doesn't mean you should give anything less than 1 hour a day or 7 hours a week towards the learning paths (LP)"],
        "context_filter":""
        },
        {"tag":"question19",
        "patterns":["I had press finished button of LP1 task but want to resume the task, how to do that?","after pressing finished button of learning path how to resume the task"],
        "responses":["You can go back to that task and then click on More and then resume to restart that task"],
        "context_filter":""
        },
        {"tag":"question20",
        "patterns":["The web pages on mobile are not showing properly","How to view web page on mobile","web page is not proper on mobile phone","i can't see web page on mobile"],
        "responses":["They are purposefully only configured for Desktops/Laptops. In an emergency, you can use the show as desktop mode of your browser"],
        "context_filter":""
        },
        {"tag":"question21",
        "patterns":["I have opted for a blockchain internship, can I also learn about AI and do an internship in both?","I have taken internship can i also learn different topic in internship"],
        "responses":["You can learn both the technologies using Learning Path 2 which will begin after the 2nd week of March, but your internship will only be continuing with the one you are selected for"],
        "context_filter":""
        },
        {"tag":"question22",
        "patterns":["Can I switch my technology now?","Can i change technology","How can i have Different tenhnology"],
        "responses":["You cannot switch the technology currently. You have to continue with the one you are selected for. In the case of multiple form entries, you just got selected for one of them; the first one that you entered. You cannot make a switch right now"],
        "context_filter":""
        },
        {"tag":"question23",
        "patterns":["Can you help me by telling how can I get to know about my progress of LP 1","How to track progress of LP1","what is my score for Lp","How to track progress of LP"],
        "responses":["There is no metric to score your progress in any learning paths as it will be at a different pace for every individual."],
        "context_filter":""
        },
        {"tag":"question24",
        "patterns":["What to do after LP3?","After LP3 what to do?"],
        "responses":["You'll be given preparatory leave (PL) from April to June after that your Live Projects will be given after the first week of June."],
        "context_filter":""
        },
        {"tag":"question25",
        "patterns":[" What happens in LP3?","What is LP3","What to do in LP3"],
        "responses":["LP3 will be assignment based and its execution and content vary from technology to technology. This assignment will be like a mini-project for all interns in a particular technology which will be verified by Cloud Counselage Project Managers."],
        "context_filter":""
        },
        {"tag":"question26",
        "patterns":["What happens in LP2?","What is Lp2","what kind of training expect in Lp2"],
        "responses":["The main focus of LP2 is to provide you with a basic foundation of the technology you're interested in. The training is also handpicked in such a way that they enable you to work on LP3 assignments which interim gives you the beginning to start your study for the selected technology and in no terms is the only/ final training you should look into. Please keep learning after your LP2 is complete, that is the only way to grow in your technology of choice"],
        "context_filter":""
        },
        {"tag":"question27",
        "patterns":["Can we skip any training if we are already clear with the basics?","I already know basic so can i skip the training"],
        "responses":["No, these pieces of training will cover basics and there is no harm in brushing up your skills before you start with the assignments later"],
        "context_filter":""
        },
        {"tag":"question28",
        "patterns":["Is it ok to clock-out before an hour is completed if the tasks are completed?","Do we need to clock-in and compulsorily complete 7 hours a week even if the tasks are completed?","if task are completed do we need to clock-in?","About clock-in and clock-out"],
        "responses":["If the tasks are completed, there is no need to clock-in and clock-out unnecessarily for hours. However, you should keep a track of all the updates of the internship being posted on the groups"],
        "context_filter":""
        },
        {"tag":"question29",
        "patterns":["Resource links not working. What to do? Should we skip?","what to do if links are not working","Can we skip if links is not working"],
        "responses":["Please do not skip any piece of training, in case you're not able to access any link please message to Cloud Counselage HR and drop an email to hrsupport@cloudcounselage.in regarding the same"],
        "context_filter":""
        },
        {"tag":"question30",
        "patterns":["What to do when our university exams start?","How to do internship in University Exams","Do we get leave in University exams?"],
        "responses":["We have provided our interns with preparatory leave from the exam season, nevertheless, you are free to work on your LP3 assignment, but we suggest to concentrate on your exams first"],
        "context_filter":""
        },
        {"tag":"question31",
        "patterns":["Is it okay to mention this internship as ongoing for college records?","can i mention this internship in college"],
        "responses":["Yes, we'll provide every intern a joining letter as soon as all interns are inducted"],
        "context_filter":""
        },
        {"tag":"question32",
        "patterns":["Can we do another internship with IP?","I want to do another internship. Can i ?"],
        "responses":["Yes, you can do another internship outside of Cloud Counselage but please ensure to provide 1 hour a day or 7 hours a week for IP."],
        "context_filter":""
        },
        {"tag":"question33",
        "patterns":["What to do after Live Projects?","Are we getting an offer letter or Stipend?","After Live project will i get offer letter?"],
        "responses":["Submit your project and once it's reviewed as successful, collect your internship letter. Your internship is complete after this. There is no stipend for live projects. If your work is sublime and we have a vacancy in the position you're interested in, you may be offered a chance for interviews and can get an offer letter from Cloud Counselage Pvt. Ltd"],
        "context_filter":""
        },
        {"tag":"question34",
        "patterns":["When will we get an internship completion letter?","When we will get Internship completion letter?"],
        "responses":["This is a three (3) month internship conducted in the month of March, June & July 2020. You will receive your internship experience letter in August during the convocation only if you successfully submit your Live Project."],
        "context_filter":""
        },
        {"tag":"question35",
        "patterns":["What will be the projects in AI or ML etc. technologies in LP3 Live Projects?","what will be the live projects","What are live project"],
        "responses":["Projects in LP3 and Live Projects will be relevant to your training and ongoing projects in Cloud Counselage. The actual problem statements will only be given when the LP3/ Live Project phase is in progress to keep the interns focused on LP1/ LP2"],
        "context_filter":""
        },
        {"tag":"question36",
        "patterns":["Not able to see the task as not part of the IP workgroup","I am not in part of IP workgroup","How to be in Ip workgroup"],
        "responses":[" Please message Cloud Counselage HR in Bitrix24"],
        "context_filter":""
        },
        {"tag":"question37",
        "patterns":["Live Project and LP3 has to be submitted individually or it will be a group project?","is Lp3 and Live project is Individual"],
        "responses":["All the LP3 and Live Projects are on an individual scale"],
        "context_filter":""
        },
        {"tag":"question38",
        "patterns":["How can we check our weekly hours?","How to check Weekly hours?"],
        "responses":["In the menu select 'time and reports' ->worktime and then you could see your worktime or click on this link once you are logged in to Bitrix24 https://cloudcounselage24.bitrix24.com/timeman/timeman.php"],
        "context_filter":""
        },
        {"tag":"question39",
        "patterns":["Is it necessary to attend LP1 for other domains as well if we want to take its training.","Lp1 training for other domain is same?","Lp1 training of other technology"],
        "responses":["LP1 training is common across all the technologies"],
        "context_filter":""
        },
        {"tag":"question40",
        "patterns":["Could I have done this training from other websites or resources?","can i do training from somwhere else","can i do training from other website"],
        "responses":["Yes, you could have but the reason to have these videos is to keep an enclosed environment for you to watch these tutorials without distractions with quizzes and forums for you to discuss in. As mentioned earlier, our main aim is to provide you with a starting point and baseline for the technology of your choice."],
        "context_filter":""
        },
        {"tag":"question41",
        "patterns":["Can I do certification for the training provided in LP2?","I am going to do certification for the training in lp2"],
        "responses":["Yes, Cloud Counselage has purposefully partnered with Edureka so as to enable our interns to get the advantage of the corporate benefits at 'no profit no loss' basis for Cloud Counselage, that we receive from the partnership. Being our interns, you can get huge discounts on the certifications you choose to enrol for through Cloud Counselage and Edureka. In case you want to know more about the discounts offered, please reach out to ‘Cloud Counselage HR’ or write to hrsupport@cloudcounselage.in."],
        "context_filter":""
        },
        {"tag":"question42",
        "patterns":["The videos of LP2 are taking too much time to load","Lp2 video takes too much time"],
        "responses":["We have uploaded the videos of the highest quality and best resolution which has resulted in some videos being over 1 GB as they are of hours in duration. To experience these high definition videos we request you to wait at least 5 minutes or more; depending on your computer's RAM and internet connection"],
        "context_filter":""
        },
        {"tag":"question43",
        "patterns":["Are LP1/ LP2/ LP3 a part of the Live Project?","Learning path part of live project","Learning path are live project"],
        "responses":["LP1/ LP2/ LP3 is your preparation for the Live Project. All the phases LP1/ LP2/ LP3/ Live Project are a part of this internship"],
        "context_filter":""
        },
        {"tag":"question44",
        "patterns":["Will these training be enough for us to complete the LP3 and Live Project.","Lp1 and lp2 is enough to complete live project","will these training is enough for live project"],
        "responses":["The set of training is not exhaustive and you are required to keep learning about the technology on your own to excel in your Live Project"],
        "context_filter":""
        },
        {"tag":"question45",
        "patterns":[" How do I access my quiz?","How to access quiz","How to give quiz"],
        "responses":["Step1: Go to lp1 module. Step2: Select module. Step3: Put token (it will direct you to the home screen if the token is correct). Step4: Again go to lp1 module n select that module. Step5: You will get the access by now. Step6: Register there (each time for every module). Step7: Give the quiz. Step8: Logout"],
        "context_filter":""
        },
        {"tag":"question46",
        "patterns":["I am trying to complete social media tasks. I completed that day and clicked finish but it didn't show finished in the task menu. What should I do?","I have completed social media task"],
        "responses":["Our team will verify and then only your task shall be accepted as completed. Please wait till the verification's complete."],
        "context_filter":""
        },
        {"tag":"question47",
        "patterns":["My Efficiency is 0% what should I do?","What to do when efficiency is less","How to increase efficiency"],
        "responses":["Ensure that you have clicked Start when you resume a task, the Finish button gets active only after the task is started. Once you complete the task you can then click on Finish and then the efficiency is updated in the system. However, please raise this issue with the Cloud Counselage HR, as they will look at it on a case to case basis"],
        "context_filter":""
        },
        {"tag":"question48",
        "patterns":[" Will you provide mentorship or doubt clearing sessions in this internship?","will mentorship is provided in internship","will someone will help in internship to study technology"],
        "responses":["As this is an internship you’re expected to do self-learning, mentorship is not part of an internship. However, we have created forums to resolve your doubts in the form of workgroups. As an intern ensure that you are part of relevant workgroups, i.e. ‘202003 - IP’ and your resp. Technology workgroup. In case, you are not a part of these workgroups, please reach out to ‘Cloud Counselage HR’ on Bitrix24 Chat"],
        "context_filter":""
        },
        {"tag":"question49",
        "patterns":["Problem statements of the Live Project will be chosen by the intern or will be provided by Cloud Counselage?","are we going to choose the problem statement for Live project","who will give or provide live project"],
        "responses":["Live Projects will be provided by Cloud Counselage as these are the ongoing projects of Cloud Counselage and your opportunity to create an impact in the organisation."],
        "context_filter":""
        },
        {"tag":"question50",
        "patterns":["Can we be a part of your future development team?"," Can we be hired by Cloud Counselage after this internship?","How to have job in cloud counsealge"],
        "responses":["All our current interns if performing well in our internship programs can be offered an opportunity to interview for various positions in Cloud Counsealge. Many of our now full-time employees were interns in Cloud Counselage"],
        "context_filter":""
        },
        {"tag":"question51",
        "patterns":["Can we extend this internship?","How to extend internship","How to increase the internship"],
        "responses":["Yes, you can extend your internship by being part of our other online programs like,Online Career Program."],
        "context_filter":""
        },
        {"tag":"question52",
        "patterns":["If we are working on more than one technology, are those technologies added to the certificate?","if we learned more than one technology will that technology added in certificate","Which technology is added in certificate"],
        "responses":["You are not restricted from doing the training of other technologies but you will only be given an internship certificate of the technology you’re selected for."],
        "context_filter":""
        },
        {"tag":"question53",
        "patterns":["Will Live Projects have only one technology or a mixture of technologies?","will live project be mix of many technologies","live project will consist of choosen technology"],
        "responses":["Live Projects will have only your part of technology even if there are multiple technologies that are a part of the project, you will be working only on the part that covers your technology."],
        "context_filter":""
        },
        {"tag":"question54",
        "patterns":["I forgot to clock in for a few days, will this affect my internship?","if we didn't clock in will that affect my internship?"],
        "responses":["This could have an adverse effect on your internship, please contact Cloud Counsealge HR and provide a genuine reason to miss clock in or clock out. Also, please start performing your clock in or clock out now"],
        "context_filter":""
        },
        {"tag":"question55",
        "patterns":["Will I get LP3 and Live project of technology other than what I am selected for?","Lp3 and Live project technology will be the same"],
        "responses":["you will receive LP3 and Live Projects of your respective technology"],
        "context_filter":""
        },
        {"tag":"question56",
        "patterns":["What are the company policies for IP interns?","Company polices for IP interns"],
        "responses":["The company policies will be published on www.cloudcounselage.co.in/ippolicies"],
        "context_filter":""
        },
        {"tag":"question57",
        "patterns":["I could not attend the induction last time, can I get an online induction again?"," I want some points said in the introduction", "where can I get them","How to see induction online"],
        "responses":["We have created a separate page with a pre-recorded induction, please visit it; https://www.cloudcounselage.co.in/ipinduction"],
        "context_filter":""
        },
        {"tag":"question58",
        "patterns":["Where do we push the code in LP3?","where to submit Lp3"],
        "responses":["please push you to code in a public repo of your GitHub account if required by your LP3 assignment"],
        "context_filter":""
        },
        {"tag":"question59",
        "patterns":["where should we share the link or anything relate to LP3 assignment submission?","where to share link of lp3","when to share link of lp3"],
        "responses":["For now, please concentrate on completing the task. We will ask all the interns to submit their work in the first week of June. Ensure you make it up to the mark till then as there would be no extension given that time"],
        "context_filter":""
        },
        {"tag":"question60",
        "patterns":["Live project's use case will be provided or can we have our own use case?","Live Project Use case"],
        "responses":["Live project's use case will strictly be provided by Cloud Counselage and you cannot choose your own use case"],
        "context_filter":""
        },
        {"tag":"question61",
        "patterns":["Is it necessary to clock-in if I am done with my tasks?","after all my tasks are completed is it necessary to clock in"],
        "responses":["Yes, it is mandatory to do, we are trying to include some more tasks due to the current scenarios, but adherence to clock-in/ clock-out policy is utterly important"],
        "context_filter":""
        },
        {"tag":"question62",
        "patterns":["Can we be online after 1 hour in a day?","can we be online more than 1 hour in a day"],
        "responses":["Yes, you can be"],
        "context_filter":""
        },
        {"tag":"question63",
        "patterns":["I have a query with respect to LP3 what should I do and whom should I ask?","I have doubt with Lp3","i have problem with lp3"],
        "responses":["As mentioned in the '202003-IP' workgroup, please ask all queries related to LP3 in your technology workgroup only and tag Jayanth G S  in your message"],
        "context_filter":""
        },
        {"tag":"question64",
        "patterns":["I didn't get my appointment letter yet","how to get appointment letter"],
        "responses":["If you had not attended the live induction and have registered in the pre-recorded session after 4 PM, 31st March. Then you'll get your joining letter by 30th April 2020. If you have otherwise, please a mail to hrsupport@cloudcounselage.in or ping 'Cloud Counselage HR' in B24"],
        "context_filter":""
        },
        {"tag":"question65",
        "patterns":["For some reason, I'm unable to download my LP3 assignment problem statement document shared on LP3 page, is there any other way I can get it?","I can't download Lp3 assignment problem statement","I can't access lp3 assignment problem statement"],
        "responses":["Since some of you are not able to download, please find the same document in your technology drive in the folder LP3. We have made an announcement in your respective technology workgroup as well, please check"],
        "context_filter":""
        },
        {"tag":"question66",
        "patterns":["is cloud computing training mandatory","is cloud computing traning compulsory"],
        "responses":["Yes, you'll need to complete the mandatory training as cloud computing is fundamental to many technologies and this additional knowledge will help you in your career"],
        "context_filter":""
        },
        {"tag":"question67",
        "patterns":["When will the step 3 of the internship program start?","Step 3 of internship program"],
        "responses":["Hope you and your family are in the best of health given the current scenario and you are making the most of your time through the 'Internship Program' by Cloud Counselage.According to the schedule of this internship program, some of you must have completed steps 1 and 2 of your internship and some of you must be in the process of completing step 2.Please note that as per the program schedule (https://www.cloudcounselage.com/ipmaharashtra/), the following are the dates for entering step 3, wherein interns take preparatory leaves for exams:a) 16th April 2020 - access given before 31st March 2020 b) 01st May 2020 - access given after 31st March 2020 Kindly note that we are in touch with the DTE - Maharashtra for the exam schedules of various universities in Maharashtra and the start of step 4 will be announced accordingly via individual email and our social media pages. While step 3 is in progress, you do not need to login to Bitrix24 or submit your timesheet until you are in step 4.All the best and please stay safe! See you soon in step 4"],
        "context_filter":""
        },
        {"tag":"question68",
        "patterns":["I  am getting an error:: Exception: SQLSTATE[HY000]: General error: 1 no such table: layout, what should I do?"],
        "responses":["This is due to many webpages opened, please close your browser and try again or you can open a new incognito tab and try again."],
        "context_filter":""
        }
                

   ]
}
